{
  "basics": {
    "name": "Theo Windebank",
    "label": "Senior Data Platform Engineer at Monzo Bank",
    "image": "",
    "email": "windebank.theo@gmail.com",
    "phone": "07849199189",
    "url": "https://theowindebank.co.uk",
    "summary": "High-impact engineer in Software & Data. ",
    "profiles": [
      {
        "network": "gitconnected",
        "username": "twindebank",
        "url": "https://gitconnected.com/twindebank"
      },
      {
        "network": "GitHub",
        "username": "twindebank",
        "url": "https://github.com/twindebank"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/theowindebank",
        "username": "theowindebank"
      }
    ],
    "headline": "",
    "blog": null,
    "yearsOfExperience": 5,
    "username": "twindebank",
    "locationAsString": "E3, London, UK",
    "region": "E3, London, UK",
    "karma": 10,
    "id": "9f6d81ff-3196-4f30-882c-5f38daab35f9",
    "followers": 10,
    "following": 0,
    "picture": "https://avatars.githubusercontent.com/u/16868305?v=4",
    "website": "https://theowindebank.co.uk"
  },
  "skills": [],
  "projects": [],
  "work": [
    {
      "name": "Monzo Bank",
      "location": "London, England, United Kingdom",
      "description": "",
      "position": "Senior Data Platform Engineer",
      "url": "https://www.linkedin.com/company/monzo-bank/",
      "startDate": "2020-08-01",
      "endDate": "",
      "summary": "My role has been critical in scaling Monzo's data platform to meet the self-serve needs of the data team as it has grown from 10 to 100+ people. I have acted as the both team-wide and company-wide expert on the majority of our data platform stack, helping onboard and coach new team members, giving talks to various engineering collectives across the company, and producing high quality documentation to help folks work with and develop on our data platform. Currently ranked as 'exceeding expectations'.",
      "highlights": [
        "Tech lead, dbt: led two other engineers in a project to migrate away from our custom fork of dbt to the latest version (6 versions ahead) whilst retaining custom functionality through an extension mechanism that I designed and plan to open source through Monzo.",
        "Tech lead, data access: led a project to design and build the second iteration of our data access management system. It is a policy-based distributed system built in Go that syncs permissions for 2000+ staff and 100,000+ data assets, that combines both role and attribute based access control paradigms."
      ],
      "isCurrentRole": true,
      "start": {
        "year": 2020,
        "month": 8
      },
      "end": {},
      "company": "Monzo Bank",
      "website": "https://www.linkedin.com/company/monzo-bank/"
    },
    {
      "name": "Querius",
      "location": "London",
      "description": "",
      "position": "Backend Engineer",
      "url": "https://github.com/querius-dev",
      "startDate": "2020-12-01",
      "endDate": "2021-05-01",
      "summary": "Monzo's VP of Data identified me as a high performing engineer, and as such he entrusted me to build out a BigQuery optimisation platform external to Monzo. ",
      "highlights": [
        "Build using GCP's serverless Cloud Run platform, with the infrastructure costing ~50p a day.",
        "Optimises 50,000 queries a day, and saves Monzo tens of thousands of pounds a month."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2020,
        "month": 12
      },
      "end": {
        "year": 2021,
        "month": 5
      },
      "company": "Querius",
      "website": "https://github.com/querius-dev"
    },
    {
      "name": "Monzo Bank",
      "location": "London, United Kingdom",
      "description": "",
      "position": "Data Engineer, Analytics",
      "url": "https://www.linkedin.com/company/monzo-bank/",
      "startDate": "2019-04-01",
      "endDate": "2020-08-01",
      "summary": "During this period I was identified as a high-performing / high-impact engineer, promoted at the end of my probation period, and consistently ranked as 'exceeding expectations'.",
      "highlights": [
        "Company migration to dbt: I designed and built supporting infrastructure and wrote the onboarding docs introducing the new ways of working, which were highly praised and used by everyone at Monzo who has worked with the tool. ",
        "CI/CD: Code I have written helps tens of people develop on and deploy the same data models daily, with the reliability increasing thanks to rigorous checks as well as a strong embedded data testing culture that I have helped cultivate.",
        "Tech lead, data access: I designed and led the development of a system to control access to sensitive user data. The distributed system, written in Go, is able to automatically approve or deny access requests, and allows people to securely access to the data they need within minutes via a Slack interface.",
        "Infrastructure as code, terraform: I gradually introduced infrastructure-as-code practises to the team and moved most infrastructure to be controlled by it, including our production Airflow deployment."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2019,
        "month": 4
      },
      "end": {
        "year": 2020,
        "month": 8
      },
      "company": "Monzo Bank",
      "website": "https://www.linkedin.com/company/monzo-bank/"
    },
    {
      "name": "BBC",
      "location": "London, United Kingdom",
      "description": "",
      "position": "Data Engineer",
      "url": "https://www.linkedin.com/company/bbc/",
      "startDate": "2017-11-01",
      "endDate": "2019-03-01",
      "summary": "",
      "highlights": [
        "Having joined BBC Datalab in its early formation, I worked with the team to develop organisation-wide information sharing and federation systems, using structured data, semantics, and machine learning.",
        "As an experimental team, we worked with technologies and platforms new to the BBC - discovering how best technologies and platforms such as Google Cloud, Kubernetes, and Docker, could maximise value for the audiences.",
        "Cross-functionality in the team had me deep diving into many areas, such as provisioning and managing our Kubernetes clusters using Terraform, implementing vector similarity scoring for our collaborative filtering model in Elasticsearch, developing and adding features to an API supporting a live app, and writing a library for distributed logging and tracing across our microservices.",
        "I talked at PyData London 2018 about technologies the team worked with. This proved an invaluable experience, which, among other things, emphasised the importance of the communities that surround the open source tools we use daily. In addition, I worked on communications for the team, determining how we best disseminate knowledge to the wider BBC."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2017,
        "month": 11
      },
      "end": {
        "year": 2019,
        "month": 3
      },
      "company": "BBC",
      "website": "https://www.linkedin.com/company/bbc/"
    },
    {
      "name": "Cue Sense Ltd.",
      "location": "London, United Kingdom",
      "description": "",
      "position": "Software Engineer",
      "url": "https://www.linkedin.com/company/cuesenseltd./",
      "startDate": "2017-06-01",
      "endDate": "2017-11-01",
      "summary": "",
      "highlights": [
        "Built software designed to help visually impaired people in interpreting non-verbal cues, utilising computer vision and machine learning.",
        "Constructed the entire image processing, image classification, and sound feedback pipeline for the software prototype, using Python 3 and a multitude of ML-based techniques. This built upon my experience of creating unique machine learning pipelines for novel applications.",
        "Designed around challenging physical and economical constraints, helping expand my knowledge and practical experience in designing software architecture and core algorithms for market-facing products.",
        "Pitched the product to investors, heightening my awareness and understanding of the marketing and business aspects to developing an innovative product."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2017,
        "month": 6
      },
      "end": {
        "year": 2017,
        "month": 11
      },
      "company": "Cue Sense Ltd.",
      "website": "https://www.linkedin.com/company/cuesenseltd./"
    },
    {
      "name": "University of Oxford",
      "location": "",
      "description": "",
      "position": "Software Developer (Intern)",
      "url": "https://www.linkedin.com/school/oxforduni/",
      "startDate": "2016-06-01",
      "endDate": "2016-09-01",
      "summary": "",
      "highlights": [
        "Used a variety of machine learning techniques during my internship within the Oxford-Man Institute of Quantitative Finance, working on a project to detect mosquito presence, species, and gender from audio recordings.",
        "Developed a fully-featured python package to act as a test-bed for detection algorithms, aimed for a public open source release. This has improved my skills in coding for a long term project where the code will be further used and worked on by others.",
        "Planned and carried out a series of microphone tests, resulting in a large batch of microphones being purchased and used to capture further biological recordings.",
        "Built upon this work within my fourth year university project, receiving a mark of 83 on final grading.",
        "Feedback from supervisors placed me in the top 5% of students who have worked with the Oxford-Man institute, confirming my ability to carry out high value work in this sector."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2016,
        "month": 6
      },
      "end": {
        "year": 2016,
        "month": 9
      },
      "company": "University of Oxford",
      "website": "https://www.linkedin.com/school/oxforduni/"
    }
  ],
  "publications": [
    {
      "name": "Mosquito Detection with Neural Networks: The Buzz of Deep Learning",
      "publisher": "",
      "releaseDate": "2017-05-15",
      "url": "https://arxiv.org/abs/1705.05180",
      "summary": "",
      "fullReleaseDate": {
        "year": 2017,
        "month": 5,
        "day": 15
      },
      "website": "https://arxiv.org/abs/1705.05180"
    }
  ],
  "education": [
    {
      "institution": "University of Oxford",
      "url": "",
      "area": "Engineering Science",
      "studyType": "Master’s Degree",
      "startDate": "2013-12-01",
      "endDate": "2017-12-01",
      "score": "2.i (68)",
      "courses": [],
      "description": "",
      "activities": "",
      "start": {
        "year": 2013,
        "month": 12
      },
      "end": {
        "year": 2017,
        "month": 12
      },
      "website": "",
      "gpa": "2.i (68)"
    },
    {
      "institution": "Queen Elizabeth High School",
      "url": "",
      "area": "",
      "studyType": "",
      "startDate": "2007-12-01",
      "endDate": "2013-12-01",
      "score": "",
      "courses": [],
      "description": "",
      "activities": "",
      "start": {
        "year": 2007,
        "month": 12
      },
      "end": {
        "year": 2013,
        "month": 12
      },
      "website": "",
      "gpa": ""
    }
  ],
  "volunteer": [
    {
      "organization": "Engineers Without Borders - Oxford (EWBOx)",
      "position": "Software Developer",
      "url": "https://www.linkedin.com/company/5348661",
      "startDate": "2015-10-01",
      "endDate": "2016-05-01",
      "summary": "Built a data collection system for a team to gather and process information on malaria cases in rural Peru with a PHP/MySQL back-end, improving my project management and team-work skills.",
      "highlights": [],
      "location": "",
      "start": {
        "year": 2015,
        "month": 10
      },
      "end": {
        "year": 2016,
        "month": 5
      },
      "website": "https://www.linkedin.com/company/5348661"
    }
  ],
  "awards": [
    {
      "title": "Gibb's Proze",
      "date": "2016-07-01",
      "awarder": "The University of Oxford",
      "summary": "Best team project of the engineering cohort.",
      "fullDate": {
        "year": 2016,
        "month": 7
      }
    }
  ],
  "languages": null,
  "interests": [],
  "references": [],
  "certificates": [
    {
      "name": "Google Cloud Certified Professional Data Engineer",
      "issuer": "Google",
      "date": "2021-06-01",
      "url": "",
      "summary": "",
      "fullDate": {
        "year": 2021,
        "month": 6,
        "day": null
      },
      "website": ""
    }
  ],
  "meta": {
    "note": "This is a combined version of the old and new JSON Resume API to provide maximum compatibility. You will notice duplicated values in different fields.",
    "canonical": "https://raw.githubusercontent.com/jsonresume/resume-schema/master/resume.json",
    "version": "v1.0.0",
    "lastModified": "2020-12-29T15:53:00"
  },
  "theme": "actual"
}